{
    "posts": [
        {
            "id": "1",
            "slug": "receta-pan-casero",
            "image": "https://www.anediblemosaic.com/wp-content/uploads//2023/11/homemade-garlic-bread-recipe-featured-image.jpg",
            "title": "Receta de Pan Casero",
            "description": "Aprende a hacer pan en casa fácilmente.",
            "content": "Hacer pan en casa puede parecer complicado, pero es una experiencia gratificante. Comienza mezclando harina, agua, levadura y sal en un bol grande. \n\nAmasa la mezcla durante 10 minutos hasta que esté suave y elástica. Deja reposar en un lugar cálido hasta que duplique su tamaño. \n\nHornea a 200°C durante 30 minutos o hasta que esté dorado. El aroma llenará tu hogar y tendrás pan fresco listo para disfrutar.",
            "author": "Cecilia Pérez",
            "date": "2025-01-20",
            "likes": 12,
            "section": "Comidas"
        },
        {
            "id": "2",
            "slug": "tarta-de-manzana-facil",
            "image": "https://www.feastingathome.com/wp-content/uploads/2024/10/Apple-Cake-14.jpg",
            "title": "Tarta de Manzana Fácil",
            "description": "Prepara una deliciosa tarta de manzana en pocos pasos.",
            "content": "La tarta de manzana es un clásico que nunca falla. Para empezar, prepara una base de masa quebrada o usa una ya lista. \n\nPela y corta las manzanas en rodajas finas, mezclándolas con azúcar y canela al gusto. Coloca las manzanas sobre la masa y hornea a 180°C durante 40 minutos. \n\nDeja enfriar antes de servir, y si lo deseas, acompaña con helado de vainilla para un toque especial.",
            "author": "Juan García",
            "date": "2025-01-19",
            "likes": 8,
            "section": "Postres"
        },
        {
            "id": "3",
            "slug": "sopa-de-calabaza",
            "image": "https://becs-table.com.au/wp-content/uploads/2018/08/Pumkin-and-ham-soup-in-black-bowls.jpg",
            "title": "Sopa de Calabaza Cremosa",
            "description": "Una sopa reconfortante y saludable para días fríos.",
            "content": "La sopa de calabaza es sencilla y deliciosa. Pela y corta la calabaza en cubos. \n\nSofríe cebolla y ajo en una olla grande, luego agrega la calabaza y caldo de verduras. Cocina hasta que la calabaza esté tierna. \n\nTritura todo con una batidora y añade crema para darle una textura más suave. Sirve caliente con un poco de pan crujiente.",
            "author": "Ana López",
            "date": "2025-01-18",
            "likes": 15,
            "section": "Comidas"

        },
        {
            "id": "4",
            "slug": "ensalada-cesar-tradicional",
            "image": "https://cdn.prod.website-files.com/6425f03eadc96686600b6d52/652763326d034d8c641c0ef4_Endive%20Caesar%20Salad%20with%20Tarragon.png",
            "title": "Ensalada César Tradicional",
            "description": "Una ensalada clásica con un toque moderno.",
            "content": "Para una ensalada César perfecta, necesitas lechuga fresca, crutones, queso parmesano y un buen aderezo. \n\nEl aderezo tradicional incluye anchoas, ajo, yema de huevo, mostaza, jugo de limón y aceite de oliva. Mezcla todo y adereza la ensalada justo antes de servir. \n\nPuedes añadir pollo a la parrilla para hacerla más sustanciosa. Es un plato ideal para cualquier ocasión.",
            "author": "Mario Sánchez",
            "date": "2025-01-17",
            "likes": 10,
            "section": "Comidas"
        },
        {
            "id": "5",
            "slug": "pizza-casera",
            "image": "https://blog.supermercadosmas.com/wp-content/uploads/2016/06/pizzas-caseras-supermercados-mas.jpg",
            "title": "Pizza Casera con Masa Artesanal",
            "description": "Haz tu propia pizza desde cero.",
            "content": "Hacer pizza en casa es divertido y delicioso. Prepara una masa mezclando harina, agua, levadura y un toque de aceite de oliva. \n\nDeja reposar la masa durante una hora. Extiéndela sobre una superficie enharinada y añade tus ingredientes favoritos, como salsa de tomate, queso mozzarella y pepperoni. \n\nHornea a 220°C hasta que la masa esté crujiente y el queso derretido. ¡Disfruta tu creación casera!",
            "author": "Cecilia Pérez",
            "date": "2025-01-16",
            "likes": 22,
            "section": "Comidas"
        },
        {
            "id": "6",
            "slug": "brownies-chocolate",
            "image": "https://natashaskitchen.com/wp-content/uploads/2020/08/Chocolate-Brownie-Recipe-5.jpg",
            "title": "Brownies de Chocolate Intensos",
            "description": "Los brownies más ricos y fáciles de hacer.",
            "content": "Estos brownies son irresistibles. Derrite chocolate con mantequilla en una cacerola a fuego lento. \n\nAgrega azúcar, huevos y un poco de harina tamizada. Mezcla bien y vierte en un molde engrasado. \n\nHornea a 180°C durante 25 minutos. Deja enfriar antes de cortar en porciones. Puedes añadir nueces para un toque extra.",
            "author": "Laura Martínez",
            "date": "2025-01-15",
            "likes": 30,
            "section": "Postres"
        },
        {
            "id": "7",
            "slug": "curry-pollo",
            "image": "https://assets.vogue.in/photos/5efdf623800c753aed1a4acd/master/pass/chicken%20curry%20recipe%20homestyle%20chicken%20curry%20recipe%20easy%20recipes%20to%20make%20at%20home%20chicken%20and%20rice.jpg",
            "title": "Curry de Pollo Fácil",
            "description": "Un plato exótico y lleno de sabor.",
            "content": "El curry de pollo es una receta sencilla y deliciosa. Sofríe cebolla, ajo y jengibre en una sartén. \n\nAñade trozos de pollo y cocina hasta que estén dorados. Incorpora pasta de curry y leche de coco, mezclando bien. \n\nDeja cocinar a fuego lento durante 20 minutos. Sirve con arroz blanco y disfruta de este plato lleno de aromas.",
            "author": "Mario Sánchez",
            "date": "2025-01-14",
            "likes": 18,
            "section": "Comidas"
        },
        {
            "id": "8",
            "slug": "galletas-mantequilla",
            "image": "https://curlygirlkitchen.com/wp-content/uploads/2024/08/Danish-Butter-Cookies-Shortbread-High-Altitude-020.jpg",
            "title": "Galletas de Mantequilla Clásicas",
            "description": "Las galletas perfectas para acompañar el té o café.",
            "content": "Para estas galletas necesitas mantequilla, azúcar, harina y un toque de vainilla. Mezcla todos los ingredientes hasta obtener una masa suave. \n\nForma pequeñas bolitas y aplástalas ligeramente en una bandeja para hornear. \n\nHornea a 180°C durante 12 minutos o hasta que estén doradas. Deja enfriar antes de servir y acompaña con una bebida caliente.",
            "author": "Ana López",
            "date": "2025-01-13",
            "likes": 14,
            "section": "Postres"
        },
        {
            "id": "9",
            "slug": "paella-mariscos",
            "image": "https://content-cocina.lecturas.com/medio/2023/01/17/paella_tipica_valenciana_con_pollo_conejo_y_garrofon_00000000_240823141841_1200x1200.jpg",
            "title": "Paella de Mariscos",
            "description": "El sabor del mar en un plato tradicional.",
            "content": "La paella de mariscos es un plato icónico. Comienza sofriendo cebolla, ajo y pimiento en una paellera. \n\nAñade arroz, caldo de pescado y azafrán. Incorpora mariscos como camarones, mejillones y calamares, dejando que se cocinen lentamente. \n\nDeja reposar antes de servir para que los sabores se integren. ¡Es un verdadero festín para los sentidos!",
            "author": "Juan García",
            "date": "2025-01-12",
            "likes": 20,
            "section": "Comidas"
        },
        {
            "id": "10",
            "slug": "batido-frutas",
            "image": "https://i.pinimg.com/736x/bd/82/0f/bd820f02b154f043db38b614988dd6c1.jpg",
            "title": "Batido de Frutas Refrescante",
            "description": "Una bebida saludable y deliciosa para cualquier momento.",
            "content": "Los batidos son rápidos y fáciles de preparar. Mezcla frutas como plátano, fresas y mango con leche o yogur en una licuadora. \n\nAñade un poco de miel o azúcar si prefieres un sabor más dulce. Sirve frío con hielo para un toque refrescante. \n\nEs una excelente opción para el desayuno o como merienda saludable.",
            "author": "Laura Martínez",
            "date": "2025-01-11",
            "likes": 25,
            "section": "Bebidas"
        },
        {
            "id": "11",
            "slug": "pasta-carbonara",
            "image": "https://www.perfectitaliano.com.au/content/dam/perfectitaliano-aus/recipe/0_desktop/Desktop-QuickEasy-Fettucine-Carbonara.jpg",
            "title": "Pasta Carbonara Clásica",
            "description": "La receta auténtica de pasta carbonara italiana.",
            "content": "Para preparar una auténtica carbonara, necesitarás pasta, huevos, queso pecorino, panceta y pimienta negra. \n\nCocina la pasta al dente y, mientras tanto, sofríe la panceta en una sartén. Mezcla huevos y queso en un bol hasta formar una crema. \n\nAgrega la pasta caliente a la sartén con panceta, retira del fuego y mezcla con la crema de huevo. Sirve inmediatamente con más queso y pimienta.",
            "author": "Cecilia Pérez",
            "date": "2025-01-10",
            "likes": 17,
            "section": "Comidas"
        },
        {
            "id": "12",
            "slug": "ensalada-quinoa",
            "image": "https://beatrizlarrea.com/cdn/shop/articles/Screen-Shot-2022-12-01-at-11.32.26-882x1024.png?v=1687267845&width=1920",
            "title": "Ensalada de Quinoa y Vegetales",
            "description": "Un plato fresco y nutritivo.",
            "content": "La ensalada de quinoa es una opción saludable y deliciosa. Cocina la quinoa según las instrucciones del paquete y déjala enfriar. \n\nMezcla con vegetales frescos como pepino, tomate y pimiento, y adereza con limón, aceite de oliva y hierbas frescas. \n\nEs perfecta como plato principal o como acompañamiento para carnes y pescados.",
            "author": "Ana López",
            "date": "2025-01-09",
            "likes": 19,
            "section": "Comidas"
        },
        {
            "id": "13",
            "slug": "flan-caramelo",
            "image": "https://phantom-telva.unidadeditorial.es/7ed92e8c5dd6a7cb6811b979d11468c8/resize/828/f/jpg/assets/multimedia/imagenes/2021/11/17/16371582241579.jpg",
            "title": "Flan de Caramelo Casero",
            "description": "Un postre clásico y fácil de preparar.",
            "content": "El flan de caramelo es un postre que encanta a todos. Comienza preparando un caramelo con azúcar y agua, vertiéndolo en moldes individuales. \n\nMezcla leche, huevos y vainilla en un bol, y vierte la mezcla sobre el caramelo. Hornea al baño maría durante 40 minutos a 180°C. \n\nDeja enfriar en el refrigerador antes de desmoldar y servir.",
            "author": "Juan García",
            "date": "2025-01-08",
            "likes": 22,
            "section": "Postres"
        },
        {
            "id": "14",
            "slug": "pollo-asado-limon",
            "image": "https://content-cocina.lecturas.com/medio/2022/07/12/pollo-al-horno-con-limon_776bf414_1280x720.jpg",
            "title": "Pollo Asado al Limón",
            "description": "Una receta fácil y deliciosa para toda la familia.",
            "content": "El pollo asado al limón es jugoso y sabroso. Coloca un pollo entero en una bandeja y sazona con sal, pimienta, ajo y hierbas. \n\nExprime jugo de limón por encima y añade rodajas de limón alrededor. Hornea a 200°C durante una hora o hasta que esté bien cocido. \n\nSirve con papas al horno o una ensalada fresca.",
            "author": "Mario Sánchez",
            "date": "2025-01-07",
            "likes": 24,
            "section": "Comidas"
        },
        {
            "id": "15",
            "slug": "crepes-dulces",
            "image": "https://cravinghomecooked.com/wp-content/uploads/2023/08/crepe-recipe-1-12-1229x1536.jpg",
            "title": "Crepes Dulces con Frutas",
            "description": "Un desayuno o postre ligero y delicioso.",
            "content": "Los crepes son versátiles y fáciles de hacer. Mezcla harina, huevos, leche y un poco de azúcar para formar una masa líquida. \n\nCocina pequeñas porciones en una sartén caliente y ligeramente engrasada. Sirve con frutas frescas, miel o chocolate derretido. \n\nEs un plato perfecto para compartir en cualquier momento del día.",
            "author": "Laura Martínez",
            "date": "2025-01-06",
            "likes": 29,
            "section": "Postres"
        },
        {
            "id": "16",
            "slug": "gazpacho-andaluz",
            "image": "https://ladespensasupermercados.es/wp-content/uploads/2022/05/gazpacho-blog.jpg",
            "title": "Gazpacho Andaluz Refrescante",
            "description": "Una sopa fría ideal para el verano.",
            "content": "El gazpacho andaluz es un clásico de la cocina española. Tritura tomates, pimientos, pepino, ajo y pan duro con un poco de agua. \n\nAñade aceite de oliva, vinagre y sal al gusto. Refrigera durante al menos una hora antes de servir. \n\nSirve en tazones individuales con trocitos de pan y vegetales como guarnición.",
            "author": "Cecilia Pérez",
            "date": "2025-01-05",
            "likes": 15,
            "section": "Comidas"
        },
        {
            "id": "17",
            "slug": "muffins-arandanos",
            "image": "https://mandolina.co/wp-content/uploads/2024/07/muffins_de_salvado_de_trigo_receta_mandolina.jpg",
            "title": "Muffins de Arándanos Esponjosos",
            "description": "Pequeños pasteles perfectos para cualquier ocasión.",
            "content": "Los muffins de arándanos son ideales para desayunos y meriendas. Mezcla harina, azúcar, levadura y una pizca de sal en un bol. \n\nEn otro recipiente, combina leche, huevo y mantequilla derretida, y añade a los ingredientes secos. Incorpora arándanos frescos y vierte en moldes para muffins. \n\nHornea a 180°C durante 20 minutos o hasta que estén dorados. Deja enfriar y disfruta.",
            "author": "Ana López",
            "date": "2025-01-04",
            "likes": 21,
            "section": "Postres"
        },
        {
            "id": "18",
            "slug": "pescado-horno",
            "image": "https://nutriologapaulinamadero.com/wp-content/uploads/Salmon-al-horno-con-esparragos.webp",
            "title": "Pescado al Horno con Hierbas",
            "description": "Una receta saludable y fácil de preparar.",
            "content": "El pescado al horno es una opción nutritiva y deliciosa. Coloca un filete de pescado en una bandeja y sazona con sal, pimienta y hierbas como romero o tomillo. \n\nAñade un chorrito de aceite de oliva y rodajas de limón por encima. Hornea a 180°C durante 15-20 minutos o hasta que esté cocido. \n\nAcompaña con vegetales al vapor para un plato completo.",
            "author": "Mario Sánchez",
            "date": "2025-01-03",
            "likes": 18,
            "section": "Comidas"
        },
        {
            "id": "19",
            "slug": "arroz-con-leche",
            "image": "https://recetas.encolombia.com/wp-content/uploads/2012/12/Arroz-con-Leche-recetas-1.jpg",
            "title": "Arroz con Leche Cremoso",
            "description": "Un postre tradicional lleno de sabor.",
            "content": "El arroz con leche es un postre fácil y delicioso. Cocina arroz en leche con canela y cáscara de limón a fuego lento. \n\nAñade azúcar al gusto y sigue removiendo hasta obtener una textura cremosa. Sirve frío o caliente, espolvoreado con canela molida. \n\nEs perfecto para disfrutar después de una comida o como merienda.",
            "author": "Laura Martínez",
            "date": "2025-01-02",
            "likes": 20,
            "section": "Postres"
        },
        {
            "id": "20",
            "slug": "tiramisu-casero",
            "image": "https://dressingfood.es/wp-content/uploads/TIRAMISU-2-WEB.jpg",
            "title": "Tiramisú Casero Clásico",
            "description": "Un postre italiano que encanta a todos.",
            "content": "El tiramisú es un postre elegante y fácil de hacer. Mezcla queso mascarpone con azúcar y huevos hasta obtener una crema suave.\nEmpapa bizcochos en café y colócalos en capas alternadas con la crema en un molde. Espolvorea cacao en polvo por encima y refrigera durante al menos 4 horas.\nEs ideal para ocasiones especiales o como un dulce capricho.",
            "author": "Cecilia Pérez",
            "date": "2025-01-01",
            "likes": 28,
            "section": "Postres"
        },
        {
            "id": "21",
            "slug": "cafe-irlandes",
            "image": "https://www.foodandwine.com/thmb/TNVoBB4XaCn6zBdeCCrwmRRZE-M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Why-Irish-Coffee-Should-Replace-The-Espresso-Martini-FT-BLOG0922-2000-0c1acd57e2f54aaeb41aecd1e0885dd3.jpg",
            "title": "Café Irlandés",
            "description": "Un café elegante con un toque de whisky.",
            "content": "El café irlandés es una bebida que combina café fuerte, azúcar moreno, whisky irlandés y crema batida. Calienta una copa, agrega el azúcar y el whisky, y mezcla con el café recién hecho. Completa con una capa de crema batida y sirve inmediatamente. Perfecto para una noche fría o una ocasión especial.",
            "author": "Roberto Martínez",
            "date": "2025-01-10",
            "likes": 45,
            "section": "Bebidas"
        },
        {
            "id": "22",
            "slug": "matcha-latte",
            "image": "https://www.recetasnestlecam.com/sites/default/files/srh_recipes/d25b198c592bdad94cf2902ff4e5634d.jpg",
            "title": "Matcha Latte",
            "description": "Una bebida saludable y deliciosa con té verde.",
            "content": "El matcha latte es una bebida cremosa y vibrante. Mezcla 1 cucharadita de polvo de matcha con un poco de agua caliente hasta formar una pasta. Añade leche caliente espumada y endulza al gusto con miel o azúcar. Es ideal para las mañanas o para una pausa relajante durante el día.",
            "author": "Laura Gómez",
            "date": "2025-01-15",
            "likes": 38,
            "section": "Bebidas"
        },
        {
            "id": "23",
            "slug": "chocolate-caliente-especiado",
            "image": "https://images.squarespace-cdn.com/content/v1/62ec1fc995263d65f21175de/1671314880121-16AT9M9KNX39EKO8ULLX/hotchocolate5.jpg",
            "title": "Chocolate Caliente Especiado",
            "description": "Un clásico reconfortante con un toque especial.",
            "content": "El chocolate caliente especiado combina el clásico sabor del chocolate con un toque de canela, nuez moscada y una pizca de pimienta de cayena. Calienta leche con trozos de chocolate negro, agrega las especias y mezcla bien. Es ideal para días fríos o para acompañar una lectura tranquila.",
            "author": "Elena Ruiz",
            "date": "2025-01-20",
            "likes": 50,
            "section": "Bebidas"
        }
    ]
}